DataProcessors/Renault_АРМ_КорпоративныеСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_АРМ_КорпоративныеСкидки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_СостоянияVINВЗаявках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СостоянияVINВЗаявках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияСогласованияКорпСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ЗаявкаНаКорпоративнуюСкидку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/RenaultFlotte_ИсторияКомментариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>RenaultFlotte_ИсторияКомментариев</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ТарифНаОпцииАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТарифНаОпцииАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаКлиентская</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаДилерская</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базовая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоступенКорпКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОпции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТарифыНаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Опция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Опции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_СостоянияСогласованияКорпСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СостоянияСогласованияКорпСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПредоставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетаНеБудет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПринят</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_ТипыЗаявокНаКорпоротивнуюСкидку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыЗаявокНаКорпоротивнуюСкидку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкидкаПриОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеСкидки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДовозмещениеСкидки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_ТипыОтгрузокНаКорпоративнуюСкидку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыОтгрузокНаКорпоративнуюСкидку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кузовостроители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возмещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оптовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажиСотрудникам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_СтатусыДоговоровНаПродажуАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыДоговоровНаПродажуАвтомобиля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИзменение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_СтатусыДокументаЗаписьНаВыдачу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыДокументаЗаписьНаВыдачу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_АРМ_КорпоративныеСкидки/Forms/ФормаЗаявкиКлиента/Ext/Form/Module.bsl
&НаКлиенте
Перем мВыбраныСсылки;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		ОткрытьСтраницуКлиента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздать(Команда)
	
	Форма = ПолучитьФорму("Справочник.Renault_КорпоративныеКлиенты.Форма.Renault_ФормаКорпоративногоКлиента");
	Форма.СправочникОбъект = Справочники.Контрагенты.СоздатьЭлемент(); 
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_КорпоративныеКлиенты" Тогда
		
		Элементы["СписокКлиентов" + Элементы.ГруппаКлиенты.ПодчиненныеЭлементы.Группа1.ПодчиненныеЭлементы.ГруппаСтатусов.ТекущаяСтраница.Имя].Обновить();
		
	ИначеЕсли ИмяСобытия = "ОбновитьРабочийЛист" Тогда
		
		Если Элементы.ГруппаСтраниц.ТекущаяСтраница.Имя = "ГруппаОбработкиВин" Тогда
			Элементы.СписокВинКлиента.Обновить();
			Элементы.СписокВыданных.Обновить();
		ИначеЕсли Элементы.ГруппаСтраниц.ТекущаяСтраница.Имя = "ГруппаВыданных" Тогда
			Элементы.СписокВыданных.Обновить();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗаписьVIN" Тогда
		
		Элементы.СписокВинКлиента.Обновить();
		Элементы.СписокВыданных.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовЧернивикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьСтраницуКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуКлиента()
	
	Контрагент = ПолучитьКонтрагентаПоКлиенту(Клиент);
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.Renault_СостоянияСогласованияКорпСкидок.ОтчетПринят);
	МассивСтатусов.Добавить(Перечисления.Renault_СостоянияСогласованияКорпСкидок.ОтчетаНеБудет);
	
	СписокВинКлиента.Параметры.УстановитьЗначениеПараметра("РабочийЛист",РабочийЛист);
	СписокВинКлиента.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	СписокВинКлиента.Параметры.УстановитьЗначениеПараметра("МассивСтатусов", МассивСтатусов);
	
	СписокВыданных.Параметры.УстановитьЗначениеПараметра("РабочийЛист",РабочийЛист);
	СписокВыданных.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	СписокВыданных.Параметры.УстановитьЗначениеПараметра("МассивСтатусов", МассивСтатусов);
	КонтактнаяИнформация.Параметры.УстановитьЗначениеПараметра("Объект", Контрагент); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтрагентаПоКлиенту(Клиент)
	
	Возврат Клиент.Контрагент;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	
	ФормаНового = ПолучитьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента");
	ДанныеФормы = ФормаНового.Объект;
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ТекущийСписок = Элементы.СписокВинКлиента;
	Иначе
		ТекущийСписок = Элементы.СписокВыданных;
	КонецЕсли;
	
	ПолучитьВыделеныеСтроки(ТекущийСписок, ТекущийСписок.ВыделенныеСтроки);
	СоздатьЗаявкуНаСервере (ДанныеФормы, мВыбраныСсылки);
	КопироватьДанныеФормы(ДанныеФормы, ФормаНового.Объект); 
	
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаВыданных Тогда
		ФормаНового.Объект.ТипЗаявки = ПредопределенноеЗначение("Перечисление.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.ВозмещениеСкидки");
	КонецЕсли;
	
	ФормаНового.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуНаСервере(ДанныеФормы, мВыбраныСсылки)
	
	ТЗЗарезервированных = Новый ТаблицаЗначений;
	ТЗЗарезервированных.Колонки.Добавить("VIN", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(17)));
	ТЗЗарезервированных.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
	
	Для Каждого СтрокаМассива из мВыбраныСсылки Цикл 
		Если Не ЗначениеЗаполнено(СтрокаМассива.СтатусЗаявки) Тогда 
			СтрокаТЗ = ТЗЗарезервированных.Добавить();
			СтрокаТЗ.VIN = СтрокаМассива.VIN;
			СтрокаТЗ.Автомобиль = СтрокаМассива.Автомобиль;
		КонецЕсли;
	КонецЦикла;
	
	ЗаявкаНаСкидку = Документы.Renault_ЗаявкаНаКорпоративнуюСкидку.СоздатьДокумент();
	ЗаявкаНаСкидку.Дата = ТекущаяДата();
	ЗаявкаНаСкидку.УстановитьНовыйНомер();
	ЗаявкаНаСкидку.Клиент = Клиент;
	ЗаявкаНаСкидку.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.ВозмещениеСкидки;
	ЗаявкаНаСкидку.ТипОтгрузки = Перечисления.Renault_ТипыОтгрузокНаКорпоративнуюСкидку.Отгрузка;
	ЗаявкаНаСкидку.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик;
	ЗаявкаНаСкидку.Автор = ПараметрыСеанса.Пользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.VIN,
	|	Таблица.Автомобиль
	|ПОМЕСТИТЬ ВТ_Автомобилей
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Автомобилей.VIN КАК ВИН,
	|	ВТ_Автомобилей.Автомобиль,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиБаза + CRM_СостояниеАвтомобилейПроизводителя_v2.ЦенаПродажиОпции, 0) КАК ЦенаPVC,
	|	ЕСТЬNULL(CRM_СостояниеАвтомобилейПроизводителя_v2.DEALER_PRICE_BASE + CRM_СостояниеАвтомобилейПроизводителя_v2.DEALER_PRICE_OPTION, 0) КАК ЦенаPVR
	|ИЗ
	|	ВТ_Автомобилей КАК ВТ_Автомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	|		ПО ВТ_Автомобилей.VIN = CRM_СостояниеАвтомобилейПроизводителя_v2.VIN";
	Запрос.УстановитьПараметр("Таблица", ТЗЗарезервированных);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество () > 0 Тогда
		ЗаявкаНаСкидку.ТаблицаВИН.Загрузить(Результат);
	КонецЕсли;
	Приемник = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.Renault_ЗаявкаНаКорпоративнуюСкидку"));
	ЗаполнитьЗначенияСвойств(Приемник, ЗаявкаНаСкидку);
	Приемник.ТаблицаВИН.Загрузить(ЗаявкаНаСкидку.ТаблицаВИН.Выгрузить()); 
	ЗначениеВДанныеФормы(Приемник, ДанныеФормы);
	мВыбраныСсылки = Новый Массив;
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере(Отбор) 
	
	МенеджерЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.VIN = Отбор.Автомобиль;
	МенеджерЗаписи.Заявка = Отбор.Заявка;
	МенеджерЗаписи.Статус = Перечисления.Renault_СостоянияСогласованияКорпСкидок.НеСогласован;
	МенеджерЗаписи.Записать();
	
	НаборЗаписи = РегистрыСведений.Renault_СостоянияVINВЗаявках.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.VIN.Установить(Отбор.Автомобиль);
	НаборЗаписи.Отбор.Заявка.Установить(Отбор.Заявка);
	НаборЗаписи.Прочитать();
	Узел = ПланыОбмена.Renault_ОчередьЗаявокНаСкидку.ПоличитьУзелОбмена();
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаВИН.Видимость = Ложь И ТекущаяСтраница = Элементы.ГруппаКлиенты Тогда
		Элементы.ГруппаВИН.Видимость = Истина;
		Элементы.ГруппаОбработки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВинКлиентаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если Поле.Имя = "СписокВинКлиентаФлаг" Тогда
			СтандартнаяОбработка = Ложь;
			мИндекс = мВыбраныСсылки.Найти(Элемент.ТекущиеДанные.Автомобиль);
			Если мИндекс = Неопределено Тогда
				мВыбраныСсылки.Добавить(Элемент.ТекущиеДанные.Автомобиль);
			Иначе
				мВыбраныСсылки.Удалить(мИндекс);
			КонецЕсли;
		ИначеЕсли Поле.Имя = "СписокВинКлиентаVIN" ИЛИ Поле.Имя = "СписокВинКлиентаАвтомобиль" Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) Тогда
				сПараметров = Новый Структура;
				сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
				сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
				сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
				ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
			КонецЕсли;
		ИначеЕсли Поле.Имя = "СписокВинКлиентаСтатусДоговора" Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.ДоговорСсылка) Тогда
				сПараметры = Новый Структура;
				сПараметры.Вставить("Ключ", ТекущаяСтрока.ДоговорСсылка);
				ОткрытьФорму("Документ.Renault_Договор.ФормаОбъекта", сПараметры);
			КонецЕсли;
		ИначеЕсли Поле.Имя = "СписокВинКлиентаСтатусЗаявки" Тогда
			Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
				сПараметры = Новый Структура;
				сПараметры.Вставить("Ключ", ТекущаяСтрока.Заявка);
				ОткрытьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента", сПараметры);
			ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
				сПараметров = Новый Структура;
				сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
				сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
				сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
				ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПолучитьВыделеныеСтроки(ЭлементСписок, ВыделенныеСтроки)
	
	мВыбраныСсылки = Новый Массив;
	Для Каждого ВыделеннаяСтрока из ВыделенныеСтроки Цикл
		мВыбраныСсылки.Добавить(ЭлементСписок.ДанныеСтроки(ВыделеннаяСтрока));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявку(Команда)
	
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ТекущийСписок = Элементы.СписокВинКлиента;
	ИначеЕсли Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаВыданных Тогда
		ТекущийСписок = Элементы.СписокВыданных;
	КонецЕсли;
	ТекущаяСтрока = ТекущийСписок.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Или ТекущаяСтрока.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
		Возврат;
	КонецЕсли;
	
	сПараметры = Новый Структура;
	сПараметры.Вставить("Ключ", ТекущаяСтрока.Заявка);
	ОткрытьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента", сПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокКомментариев()
	
	ОтключитьОбработчикОжидания("ЗаполнитьСписокКомментариев");
	Если Элементы.ГруппаСтатусов.ТекущаяСтраница = Элементы.НаСогласовании 
		И Элементы.СписокКлиентовНаСогласовании.ТекущиеДанные <> Неопределено Тогда
		ИсторияКомментариев = ПолучитьИсториюКомментариевПоЗаявке(Клиент);
	Иначе
		ИсторияКомментариев = "";
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗаполнитьСписокКомментариев", 3, Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИсториюКомментариевПоЗаявке(Клиент)
	
	Возврат РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ПолучитьКомментарииПоОбъектуСтрокой(Клиент.ИдЗаявки);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьКомментарий(Клиент, Текст)
	
	ДатаДобавления = ТекущаяУниверсальнаяДата();
	
	РегистрыСведений.RenaultFlotte_ИсторияКомментариев.ДобавитьКомментарий(
		Клиент.ИдЗаявки,
		Текст,
		ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр,
		ДатаДобавления);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКомментарий(Команда)
	
	Если Не ЗначениеЗаполнено(НовыйКомментарий) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьКомментарий(Клиент, НовыйКомментарий);
	
	ЗаполнитьСписокКомментариев();
	НовыйКомментарий = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоговор(Команда)
	
	ПолучитьВыделеныеСтроки(Элементы.СписокВинКлиента, Элементы.СписокВинКлиента.ВыделенныеСтроки); 
	СоздатьДоговорНаСервере(мВыбраныСсылки);
	Элементы.СписокВинКлиента.Обновить();
	Элементы.СписокВыданных.Обновить();
	мВыбраныСсылки = Новый Массив;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговорНаСервере (мВыбраныСсылки)
	
	мАвтомобилей = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.IDK
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.Клиент.Ссылка = &Ссылка
	|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ
	|	И Renault_РабочиеЛисты.ЗапросНаЗакрытие = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", Клиент.Контрагент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден работчий лист";
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	РабочийЛист = Выборка.IDK;
	Отдел = Renault_РаботаСПравамиПользователя.ОтделПоУмолчанию(ПараметрыСеанса.Пользователь);
	ДилерскийЦентр = Отдел.ДилерскийЦентр;
	
	Для Каждого СтрокаМассива из мВыбраныСсылки Цикл 
		
		Если ЗначениеЗаполнено(СтрокаМассива.ДоговорСсылка)
			ИЛИ СтрокаМассива.Заявка.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.СкидкаПриОтгрузке
			И СтрокаМассива.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован Тогда
			Продолжить;
		КонецЕсли;
		
		НовДок = Документы.Renault_Договор.СоздатьДокумент();
		НовДок.Дата = ТекущаяДата();
		НовДок.ДатаДоговора = ТекущаяДата();
		НовДок.ДилерскийЦентр = ДилерскийЦентр;
		
		НовДок.Клиент = Клиент.Контрагент;
		
		НовДок.НесколькоАвтомобилейВДоговоре = Ложь;
		НовДок.РабочийЛист = РабочийЛист;
		
		СтрАвто = НовДок.СоставДоговора.Добавить();
		СтрАвто.Идентификатор = Новый УникальныйИдентификатор;
		СтрАвто.VIN = СтрокаМассива.VIN;
		СтрАвто.Автомобиль = СтрокаМассива.Автомобиль;
		СтрАвто.Модель = СтрокаМассива.Автомобиль.Модель;
		СтрАвто.Версия = СтрокаМассива.Автомобиль.ВариантКомплектации;
		СтрАвто.Цвет = СтрокаМассива.Автомобиль.Цвет;
		СтрАвто.ГодВыпуска = Формат(СтрокаМассива.Автомобиль.ГодВыпуска, "ДФ=yyyy");
		СтрАвто.ЖелаемаяДатаВыдачи = ТекущаяДата();
		
		Запись = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
		Запись.VIN = СтрокаМассива.VIN;
		Запись.Прочитать();
		
		Если Не Запись.Выбран() Тогда
			//Все цены в ноль
			тОбщаяСуммаПоАвтомобилю = 0;
			тСтоимостьБазовойКомплектации = 0;
			тСуммаДоставки = 0;
			тСуммаСкидки = 0;
			тСтоимостьДопОпций = 0;
			тСтоимостьОпцийДилера = 0;
		Иначе
			//Получим цены продажи по данным склада
			тСтоимостьБазовойКомплектации = Запись.ЦенаПродажиБаза;
			тСуммаДоставки = Запись.ЦенаПродажиДоставка;
			тСтоимостьДопОпций = Запись.ЦенаПродажиОпции;
			тСтоимостьОпцийДилера = Запись.ЦенаПродажиДопОборудования;
			тСуммаСкидки = 0;
			ЗапролнитьДанныеПТС(СтрАвто, Запись);
		КонецЕсли;
		//Заполним окончательно в договоре
		тОбщаяСуммаПоАвтомобилю = тСтоимостьБазовойКомплектации + тСтоимостьДопОпций + тСтоимостьОпцийДилера + тСуммаДоставки;
		СтрАвто.СтоимостьБазовойКомплектации = тСтоимостьБазовойКомплектации;
		СтрАвто.СтоимостьДопОпций = тСтоимостьДопОпций;
		СтрАвто.СтоимостьОпцийДилера = тСтоимостьОпцийДилера;
		СтрАвто.ОбщаяСуммаПоАвтомобилю = тОбщаяСуммаПоАвтомобилю;
		СтрАвто.СуммаДоставки = тСуммаДоставки;
		СтрАвто.СуммаСкидки = СтрокаМассива.ЦенаPVC - СтрокаМассива.ЦенаFlotte;
		НовДок.СуммаДоговора = тОбщаяСуммаПоАвтомобилю - (СтрокаМассива.ЦенаPVC - СтрокаМассива.ЦенаFlotte);
		НовДок.ПриСозданииНовогоДоговора();
		ЗаполнитьДанныеОрганизации(НовДок);
		ЗагрузитьСписокДополнительныхОпцийПоТарифу(НовДок, СтрАвто);
		НовДок.СтатусПредварительныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
		НовДок.СтатусОкончательныхДокументов = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
		НовДок.СтатусДоговора = Перечисления.CRM_СтатусыДоговоровНаПродажуАвтомобиля.Черновик;
		Попытка
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			мАвтомобилей.Добавить(СтрокаМассива.Автомобиль);
		Исключение
			Инфо = ИнформацияОбОшибке();
		КонецПопытки
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗонаВыдачиПоУмолчанию(ДЦ = Неопределено)
	
	Если ДЦ = Неопределено Тогда
		ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя();
	КонецЕсли;
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	CRM_ДилерскиеЦентрыЗоныВыдачи.ЗонаВыдачи.Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_ДилерскиеЦентры.ЗоныВыдачи КАК CRM_ДилерскиеЦентрыЗоныВыдачи
	                      |ГДЕ
	                      |	CRM_ДилерскиеЦентрыЗоныВыдачи.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ДЦ);
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() > 0 Тогда
		Возврат Таблица[0].ЗонаВыдачиСсылка;
	Иначе
		Возврат Справочники.Renault_ЗоныВыдачиАвтомобилей.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗапролнитьДанныеПТС(СтрАвто, ЗаписьСостояниеАвтомобилейПроизводителя)
	
	СтрАвто.ПТС = ЗаписьСостояниеАвтомобилейПроизводителя.PTS_SERIE + " " + ЗаписьСостояниеАвтомобилейПроизводителя.PTS_NUM;
	СтрАвто.МаркаМодельПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ModelTS;
	СтрАвто.ТипПТС = ЗаписьСостояниеАвтомобилейПроизводителя.TypeTS;
	СтрАвто.КатегорияПТС = ЗаписьСостояниеАвтомобилейПроизводителя.CategTS;
	СтрАвто.ГодИзготовленияПТС = ЗаписьСостояниеАвтомобилейПроизводителя.YEAR;
	СтрАвто.НомерДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ENGINE_NUM;
	СтрАвто.НомерШассиПТС = ЗаписьСостояниеАвтомобилейПроизводителя.Shassi;
	СтрАвто.НомерКузоваПТС = ЗаписьСостояниеАвтомобилейПроизводителя.Kuzov;
	СтрАвто.ЦветКузоваПТС = ЗаписьСостояниеАвтомобилейПроизводителя.COLOR_PTS;
	СтрАвто.РазрешеннаяМаксимальнаяМассаПТС = ЗаписьСостояниеАвтомобилейПроизводителя.MaxMass;
	СтрАвто.МассаБезНагрузкиПТС = ЗаписьСостояниеАвтомобилейПроизводителя.MinMass;
	СтрАвто.МощностьДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.PowerLS;
	СтрАвто.РабочийОбъемДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.VolumeEngine;
	СтрАвто.ТипДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.TypeEngine;
	СтрАвто.ЭкологическийКлассДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.EcoClass;
	СтрАвто.ОрганизацияИзготовительПТС = ЗаписьСостояниеАвтомобилейПроизводителя.NaimProiz;
	СтрАвто.ОдобрениеТипаТСПТС = ЗаписьСостояниеАвтомобилейПроизводителя.APPROV_STRING; 		
	СтрАвто.ДатаПТС = ЗаписьСостояниеАвтомобилейПроизводителя.DATE_PTS;
	СтрАвто.МодельДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ENGINE_MODEL;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОрганизации(ДоговорОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН КАК ДилерИНН,
	|	Организации.КПП КАК ДилерКПП,
	|	Организации.НаименованиеПолное КАК ДилерНаименованиеОрганизации,
	|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК ДилерБанк,
	|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК ДилерКоррСчет,
	|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК ДилерБИК,
	|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК ДилерСчет,
	|	КонтактнаяИнформацияАдресФактический.Представление КАК ДилерАдресФактический,
	|	КонтактнаяИнформацияАдресЮридический.Представление КАК ДилерАдресЮридический,
	|	КонтактнаяИнформацияТелефон.Представление КАК ДилерТелефон
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресЮридический
	|		ПО Организации.Ссылка = КонтактнаяИнформацияАдресЮридический.Объект
	|			И (&ВидАдресЮр = КонтактнаяИнформацияАдресЮридический.Вид)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресФактический
	|		ПО Организации.Ссылка = КонтактнаяИнформацияАдресФактический.Объект
	|			И (&ВидАдресФакт = КонтактнаяИнформацияАдресФактический.Вид)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|		ПО Организации.Ссылка = КонтактнаяИнформацияТелефон.Объект
	|			И (&ВидТелефон = КонтактнаяИнформацияТелефон.Вид)
	|ГДЕ
	|	Организации.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДоговорОбъект.Организация);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	Запрос.УстановитьПараметр("ВидАдресФакт", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Запрос.УстановитьПараметр("ВидАдресЮр", Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДоговорОбъект, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокДополнительныхОпцийПоТарифу(ДоговорОбъект, СтрАвто)
	
	ДоговорОбъект.ДопОпцииАвтомобилей.Очистить();
	Тариф = Renault_CRM.ПолучитьТекущийТарифНаАвтомобили(ДоговорОбъект.ДатаДоговора);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", СтрАвто.Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", СтрАвто.Версия);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	Запрос.УстановитьПараметр("Идентификатор", СтрАвто.Идентификатор);
	Запрос.УстановитьПараметр("ДатаДоговора", ДоговорОбъект.ДатаДоговора);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Идентификатор КАК Идентификатор,
	|	ЛОЖЬ КАК Выбран,
	|	Renault_ТарифНаОпцииАвтомобилей.Опция КАК Опция,
	|	Renault_ТарифНаОпцииАвтомобилей.ЦенаКлиентская КАК Цена,
	|	Renault_ТарифНаОпцииАвтомобилей.Опция.Артикул КАК Код,
	|	ВЫРАЗИТЬ(Renault_ТарифНаОпцииАвтомобилей.Опция.НаименованиеПолное КАК СТРОКА(500)) КАК Наименование,
	|	10 КАК НомерСтроки
	|ИЗ
	|	РегистрСведений.Renault_ТарифНаОпцииАвтомобилей.СрезПоследних(
	|			,
	|			Модель = &Модель
	|				И ВариантКомплектации = &ВариантКомплектации
	|				И Тариф = &Тариф
	|				И Базовая = ЛОЖЬ) КАК Renault_ТарифНаОпцииАвтомобилей";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	НомерСтроки = 1;
	Для Каждого Строка Из ТаблицаРезультат Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ДоговорОбъект.ДопОпцииАвтомобилей.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДоговор(Команда)
	
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ТекущийСписок = Элементы.СписокВинКлиента;
	ИначеЕсли Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаВыданных Тогда
		ТекущийСписок = Элементы.СписокВыданных;
	КонецЕсли;
	
	ТекущаяСтрока = ТекущийСписок.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекущаяСтрока.ДоговорСсылка)Тогда
		Возврат;
	КонецЕсли;
	
	сПараметры = Новый Структура;
	сПараметры.Вставить("Ключ", ТекущаяСтрока.ДоговорСсылка);
	ОткрытьФорму("Документ.Renault_Договор.ФормаОбъекта", сПараметры, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьВыдачу(Команда)
	
	Перем ДатаВыдачи;
	ПолучитьВыделеныеСтроки(Элементы.СписокВинКлиента, Элементы.СписокВинКлиента.ВыделенныеСтроки);
	Если ВвестиДату(ДатаВыдачи, "Введите планируемую дату выдачи", ЧастиДаты.Дата) Тогда 
		ЗапланироватьВыдачуНаСервере (мВыбраныСсылки, ДатаВыдачи);
	КонецЕсли;
	Элементы.СписокВинКлиента.Обновить();
	Элементы.СписокВыданных.Обновить();
	мВыбраныСсылки = Новый Массив;
	
КонецПроцедуры

&НаСервере
Процедура ЗапланироватьВыдачуНаСервере (мВыбраныСсылки, ДатаВыдачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.IDK
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.Клиент.Ссылка = &Ссылка
	|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ
	|	И Renault_РабочиеЛисты.ЗапросНаЗакрытие = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", Клиент.Контрагент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден рабочий лист";
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	РабочийЛист = Выборка.IDK;
	Отдел = Renault_РаботаСПравамиПользователя.ОтделПоУмолчанию(ПараметрыСеанса.Пользователь);
	ДилерскийЦентр = Отдел.ДилерскийЦентр;
	ЗонаВыдачи = ЗонаВыдачиПоУмолчанию(ДилерскийЦентр);
	Для Каждого СтрокаАвтомобиля из мВыбраныСсылки Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаАвтомобиля.ДоговорСсылка)
			ИЛИ СтрокаАвтомобиля.Заявка.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.СкидкаПриОтгрузке
			И СтрокаАвтомобиля.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаАвтомобиля.Событие) Тогда
			
			СобытиеОбъект = Документы.CRM_СобытияПоРабочимЛистам.СоздатьДокумент();
			СобытиеОбъект.IDK = РабочийЛист;
			СобытиеОбъект.ВидСобытия = Справочники.CRM_ВидыСобытий.Выдача;
			СобытиеОбъект.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
			СобытиеОбъект.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
			СобытиеОбъект.Отдел = Отдел;
			СобытиеОбъект.Комментарий = "Выдача автомобиля";
			СобытиеОбъект.ДилерскийЦентр = ДилерскийЦентр;
			СобытиеОбъект.Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
			СобытиеОбъект.Дата = ТекущаяДата();
			СобытиеОбъект.ДатаНапоминания = ДатаВыдачи + 3600*9;
			
			ДокВыдача = Документы.CRM_ЗаписьНаВыдачу.СоздатьДокумент();
			ДокВыдача.Дата = ТекущаяДата();
			ДокВыдача.ДилерскийЦентр = ДилерскийЦентр;
			ДокВыдача.IDK = РабочийЛист;
			ДокВыдача.Статус = Перечисления.CRM_СтатусыДокументаЗаписьНаВыдачу.Черновик;
			ДокВыдача.Клиент = Клиент.Контрагент;
			ДокВыдача.ДатаНачала =  ДатаВыдачи + 3600*9;
			ДокВыдача.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;;
			ДокВыдача.Продолжительность = 30; 
			ДокВыдача.ЗонаВыдачи = ЗонаВыдачи;
			
			СтрокаТЧ = ДокВыдача.АвтомобилиДляВыдачи.Добавить();
			СтрокаТЧ.Автомобиль = СтрокаАвтомобиля.Автомобиль;
			СтрокаТЧ.VIN = СтрокаАвтомобиля.VIN;
			СтрокаТЧ.Выбран = Истина;
			ДокВыдача.Записать(РежимЗаписиДокумента.Проведение);
			
			СобытиеОбъект.Объект = ДокВыдача.Ссылка;
			СтрокаТЧ = СобытиеОбъект.АвтомобилиДляВыдачи.Добавить();
			СтрокаТЧ.Автомобиль = СтрокаАвтомобиля.Автомобиль;
			СтрокаТЧ.VIN = СтрокаАвтомобиля.VIN;
			СтрокаТЧ.Выбран = Истина;
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выдача(Команда)
	
	ПолучитьВыделеныеСтроки(Элементы.СписокВинКлиента, Элементы.СписокВинКлиента.ВыделенныеСтроки);
	ЗапланироватьВыдачуНаСервере (мВыбраныСсылки, ТекущаяДата());
	Элементы.СписокВинКлиента.Обновить();
	Элементы.СписокВыданных.Обновить();
	ПолучитьВыделеныеСтроки(Элементы.СписокВинКлиента, Элементы.СписокВинКлиента.ВыделенныеСтроки);
	ЗавершитьВыдачуНаСервере (мВыбраныСсылки, "Автомобиль выдан");
	мВыбраныСсылки = Новый Массив;
	Элементы.СписокВинКлиента.Обновить();
	Элементы.СписокВыданных.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ЗавершитьВыдачуНаСервере(мВыбраныСсылки, СтатусВыдачи)
	
	МассивЗапланированных = Новый Массив;
	Для Каждого СтрокаАвтомобиля из мВыбраныСсылки Цикл	
		
		Если Не ЗначениеЗаполнено(СтрокаАвтомобиля.ДоговорСсылка)
			ИЛИ СтрокаАвтомобиля.Заявка.ТипЗаявки = Перечисления.Renault_ТипыЗаявокНаКорпоротивнуюСкидку.СкидкаПриОтгрузке
			И СтрокаАвтомобиля.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Согласован Тогда
			Продолжить;
		КонецЕсли;
		
		Событие = СтрокаАвтомобиля.Событие.ПолучитьОбъект();
		Событие.Обработано = Истина;
		Событие.ДатаЗакрытия = ТекущаяДата();
		Событие.АвторЗакрытия = ПараметрыСеанса.Пользователь.Сотрудник;
		Если СтатусВыдачи = "Выдача отменена" Тогда
			Событие.КомментарийЗакрытия = "Выдача отменена";
			Событие.Обработано = Ложь;
			Событие.ЗавершеноУспешно = Ложь;
		ИначеЕсли СтатусВыдачи = "Автомобиль выдан" Тогда
			Событие.КомментарийЗакрытия = "Автомобиль выдан";
			Событие.ЗавершеноУспешно = Истина;
		КонецЕсли;
		Событие.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОтменаВыдачи(Команда)
	
	Если Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОбработкиВин Тогда
		ТекущийСписок = Элементы.СписокВинКлиента;
	Иначе
		ТекущийСписок = Элементы.СписокВыданных;
	КонецЕсли;
	
	ПолучитьВыделеныеСтроки(ТекущийСписок, ТекущийСписок.ВыделенныеСтроки);
	ЗавершитьВыдачуНаСервере (мВыбраныСсылки, "Выдача отменена");
	мВыбраныСсылки = Новый Массив;
	Элементы.СписокВинКлиента.Обновить(); 
	Элементы.СписокВыданных.Обновить(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокВыданныхVIN" или Поле.Имя = "СписокВыданныхАвтомобиль" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) Тогда
			сПараметров = Новый Структура;
			сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
			сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
			сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
			ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокВыданныхДоговорСсылка" ИЛИ Поле.Имя = "СписокВыданныхСтатусДоговора" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДоговорСсылка) Тогда
			сПараметры = Новый Структура;
			сПараметры.Вставить("Ключ", ТекущаяСтрока.ДоговорСсылка);
			ОткрытьФорму("Документ.Renault_Договор.ФормаОбъекта", сПараметры);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СписокВыданныхСтатусЗаявки" Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки = Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
			сПараметры = Новый Структура;
			сПараметры.Вставить("Ключ", ТекущаяСтрока.Заявка);
			ОткрытьФорму("Документ.Renault_ЗаявкаНаКорпоративнуюСкидку.Форма.ФормаДокумента", сПараметры);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Заявка) И ТекущаяСтрока.СтатусЗаявки <> Перечисления.Renault_СостоянияСогласованияКорпСкидок.Черновик Тогда
			сПараметров = Новый Структура;
			сПараметров.Вставить("Заявка", ТекущаяСтрока.Заявка);
			сПараметров.Вставить("Автомобиль", ТекущаяСтрока.Автомобиль);
			сПараметров.Вставить("Статус", ТекущаяСтрока.СтатусЗаявки);
			ОткрытьФорму("Обработка.Renault_АРМ_КорпоративныеСкидки.Форма.ФормаVIN", сПараметров, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКомментарий(Команда)
	
	ЗаписатьКомментарийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарийНаСервере ()
	
	КлиентОбъект = Клиент.Контрагент.ПолучитьОбъект();
	КлиентОбъект.Комментарий = Коментарий;
	КлиентОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Автосклад(Команда)
	
	Форма = ПолучитьФорму("Обработка.Renault_АРМ_Автосклад.Форма");
	Форма.м_РабочийЛист = РабочийЛист;
	Форма.м_Клиент = ПолучитьКонтрагентаПоКлиенту(Клиент);
	Форма.ЗапомнитьКлиента = Истина;
	Попытка
		Форма.ОткрытьМодально();
	Исключение
		Предупреждение("Автосклад ранее уже был открыт.
			|Закройте ранее открытую форму и повторите попытку.");
	КонецПопытки;
	Элементы.СписокВинКлиента.Обновить(); 
	Элементы.СписокВыданных.Обновить(); 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Клиент = Параметры.Клиент;
	РабочийЛист = Параметры.РабочийЛист;
	Заголовок = Строка(Клиент) + ", рабочий лист №" + формат(РабочийЛист,"ЧГ=");
	АвтоЗаголовок = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКарточкуКорпКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКорпКлиента()
	
	Форма = ПолучитьФорму("ОбщаяФорма.Renault_ФормаКорпоративногоКлиента");
	Форма.Ключ = ПолучитьКонтрагента(Клиент);
	Форма.Открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонтрагента(Клиент)
	
	Возврат Клиент.Контрагент;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьОтчетЗаявкаНаКорпкидкуНаСервере(Ссылка)
	
	Возврат Отчеты.Renault_ОтчетПоЗаявкамНаКорпоративнуюСкидку.СформироватьОтчетНаСервере(Ссылка, "СхемаКомпоновкиДляДокумента");
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчетПоЗаявке(Команда)
	
	ТекущаяСтрока = Неопределено;
	
	Если Элементы.СписокВинКлиента.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокВинКлиента.ТекущиеДанные;
		
	ИначеЕсли Элементы.СписокВыданных.ТекущиеДанные <> Неопределено Тогда
		ТекущаяСтрока = Элементы.СписокВыданных.ТекущиеДанные;
		
	КонецЕсли;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		 ЗаявкаСсылка = ТекущаяСтрока.Заявка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаСсылка) Тогда
		Результат = СформироватьОтчетЗаявкаНаКорпкидкуНаСервере(ЗаявкаСсылка);
		Результат.ОтображатьЗаголовки = Ложь;
		Результат.ОтображатьСетку = Ложь;
		Результат.Показать("Отчет по заявке на корп.скидку");
	КонецЕсли;
	
КонецПроцедуры
